In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame(columns=['Name', 'Height'])
df

Empty DataFrame
Columns: [Name, Height]
Index: []

In [5]:
df.loc[0] = ['Allen', '175']

In [6]:
df

    Name Height
0  Allen    175

In [7]:
df.loc[1] = ['Ted', '180']
df

    Name Height
0  Allen    175
1    Ted    180

In [8]:
df['Weight'] = ['75', '80']
df

    Name Height Weight
0  Allen    175     75
1    Ted    180     80

In [9]:
df.drop(['Weight'], axis=1)

    Name Height
0  Allen    175
1    Ted    180

In [10]:
df

    Name Height Weight
0  Allen    175     75
1    Ted    180     80

In [11]:
df = df.drop(['Weight'], axis=1)

In [12]:
df

    Name Height
0  Allen    175
1    Ted    180

In [13]:
df.drop(0)

  Name Height
1  Ted    180

In [14]:
df

    Name Height
0  Allen    175
1    Ted    180

In [15]:
df = df.drop(0)

In [16]:
df

  Name Height
1  Ted    180

In [18]:
df.loc[0] = ['Allen', '175']
df

    Name Height
1    Ted    180
0  Allen    175

In [19]:
df.loc[3] = ['Marry', '170']
df

    Name Height
1    Ted    180
0  Allen    175
3  Marry    170

In [20]:
df['Name'][1] = 'Teddd'
df

    Name Height
1  Teddd    180
0  Allen    175
3  Marry    170

In [21]:
df2 = df
df2

    Name Height
1  Teddd    180
0  Allen    175
3  Marry    170

In [22]:
df['Name'] = 'Teddddd'
df

      Name Height
1  Teddddd    180
0  Teddddd    175
3  Teddddd    170

In [23]:
df.loc[0] = 'asdasdasdf'
df

         Name      Height
1     Teddddd         180
0  asdasdasdf  asdasdasdf
3     Teddddd         170

In [25]:
df.to_csv('./test_pandas.csv', index=0, encoding='utf-8')

In [26]:
df3 = pd.read_csv('./test_pandas.csv', encoding='utf-8')
df3

         Name      Height
0     Teddddd         180
1  asdasdasdf  asdasdasdf
2     Teddddd         170

In [27]:
columns = ['Name', 'Height']
data = [
    ['Allen', '175'],
    ['Ted', '180']
]
df4 = pd.DataFrame(data=data, columns=columns)
df4

    Name Height
0  Allen    175
1    Ted    180

In [29]:
for r in df4:
    print(r)

Name
Height

In [32]:
df4.append(['Marry', '170'])

       0 Height   Name
0    NaN    175  Allen
1    NaN    180    Ted
0  Marry    NaN    NaN
1    170    NaN    NaN

In [34]:
columns = ['Name', 'Height']
data = [
    ['Marry', '175']
]
df_a = pd.DataFrame(data=data, columns=columns)
df_a

    Name Height
0  Marry    175

In [35]:
df4.append(df_a)

    Name Height
0  Allen    175
1    Ted    180
0  Marry    175